Documents/ПереоценкаСельскохозяйственнойПродукцииПоСредневзвешеннойЦене.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПереоценкаСельскохозяйственнойПродукцииПоСредневзвешеннойЦене</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Налоговый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Налоговый</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Налоговый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Налоговый.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Налоговый.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/СобственныеКонтрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СобственныеКонтрагенты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПереоценкаСельскохозяйственнойПродукцииПоСредневзвешеннойЦене/Ext/ObjectModule.bsl
Функция ПолучитьСписокСчетов()
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаОтбора.СчетУчета
	|ИЗ
	|  Документ.ПереоценкаСельскохозяйственнойПродукцииПоСредневзвешеннойЦене.СчетаОтбора КАК СчетаОтбора
	|Где
	|	СчетаОтбора.ссылка = &ТекДокумент
	|";
	
	Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Типовой.Записывать = Истина;
	Движения.Налоговый.Записывать = Истина;
	
	СписокСчетовОтбора = ПолучитьСписокСчетов();
	
	НачДата = НачалоДня(Дата);
			
		СредняяЦена =0;
		//средняя цена для каждой номенклатуры
		ЗапросОбщий = Новый Запрос;
		ЗапросОбщий.Текст = 
			"ВЫБРАТЬ
			|	ТиповойОстатки.Субконто1 КАК Номенклатура,
			|	ТиповойОстатки.СуммаОстаток,
			|	ТиповойОстатки.КоличествоОстаток,
			|	ВЫБОР
			|		КОГДА ТиповойОстатки.КоличествоОстаток <> 0
			|			ТОГДА ТиповойОстатки.СуммаОстаток / ТиповойОстатки.КоличествоОстаток
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СредняяЦена
			|ИЗ
			|	РегистрБухгалтерии.Типовой.Остатки(&ДатаОт, Счет В (&Счета), , ) КАК ТиповойОстатки";
		
		ЗапросОбщий.УстановитьПараметр("ДатаОт", НачДата);
		ЗапросОбщий.УстановитьПараметр("Счета", СписокСчетовОтбора);
				
		РезультатЗапроса1 = ЗапросОбщий.Выполнить();
		
		ВыборкаОбщая = РезультатЗапроса1.Выбрать();
		
		Пока ВыборкаОбщая.Следующий() Цикл
			
			//средняя цена по организациям
			ЗапросПоОрг = Новый Запрос;
			ЗапросПоОрг.Текст = 
				"ВЫБРАТЬ
				|	ТиповойОстатки.Субконто1 КАК Номенклатура,
				|	ТиповойОстатки.СуммаОстаток,
				|	ТиповойОстатки.КоличествоОстаток,
				|	ВЫБОР
				|		КОГДА ТиповойОстатки.КоличествоОстаток <> 0
				|			ТОГДА ТиповойОстатки.СуммаОстаток / ТиповойОстатки.КоличествоОстаток
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК СредняяЦенаПоОрганизации,
				|	ТиповойОстатки.Организация,
				|	ТиповойОстатки.Счет
				|ИЗ
				|	РегистрБухгалтерии.Типовой.Остатки(&НачДата, Счет В (&Счета), , ) КАК ТиповойОстатки
				|ГДЕ
				|	ТиповойОстатки.Субконто1 = &ТекНоменклатура";
			
			ЗапросПоОрг.УстановитьПараметр("НачДата", НачДата);
			ЗапросПоОрг.УстановитьПараметр("Счета", СписокСчетовОтбора);
			ЗапросПоОрг.УстановитьПараметр("ТекНоменклатура", ВыборкаОбщая.Номенклатура);

			РезультатЗапроса2 = ЗапросПоОрг.Выполнить();
			
			ВыборкаПоОрганизации = РезультатЗапроса2.Выбрать();
			
			//-=-=
			СуммаКорректировкиОбщая = 0;
			//-=-=
			
			Пока ВыборкаПоОрганизации.Следующий() Цикл
				РазницаВЦене = 0;
				СуммаКорректировки = 0;
				
				Если ВыборкаОбщая.СредняяЦена <> ВыборкаПоОрганизации.СредняяЦенаПоОрганизации Тогда
					 РазницаВЦене = ВыборкаОбщая.СредняяЦена - ВыборкаПоОрганизации.СредняяЦенаПоОрганизации;
									 
					 СуммаКорректировки = РазницаВЦене*ВыборкаПоОрганизации.КоличествоОстаток;
					 
					 Если СуммаКорректировки < 0.02 И СуммаКорректировки > -0.02 Тогда 
						 Продолжить;
					 КонецЕсли;
					 
					 НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
					 НаборЗаписей.Отбор.Организация.Значение = ВыборкаПоОрганизации.Организация;
					 НаборЗаписей.Отбор.Организация.Использование = Истина;
					 НаборЗаписей.Прочитать();
					
					 Если НаборЗаписей.Количество() > 0 Тогда
						КонтрагентОрганизации = НаборЗаписей[0].Контрагент;
					 Иначе
						КонтрагентОрганизации = Справочники.Контрагенты.ПустаяСсылка();
					 КонецЕсли;
				
					 	Проводка = Движения.Типовой.Добавить();
						Проводка.Организация = ВыборкаПоОрганизации.Организация;
						Проводка.Период = НачДата;
						Проводка.СчетДт = ВыборкаПоОрганизации.Счет;
						
						ПроцедурыБухгалтерскогоУчета.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ВыборкаОбщая.Номенклатура);
											
						Проводка.СчетКт = ПланыСчетов.Типовой.КраткосрочнаяДебиторскаяЗадолженностьПредставительств;
						ПроцедурыБухгалтерскогоУчета.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, КонтрагентОрганизации);
						ПроцедурыБухгалтерскогоУчета.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Справочники.СтатьиОборотов.ПереоценкаСельскохозяйственнойПродукции);
						
						Проводка.Сумма = СуммаКорректировки;
						
						//налоговый
						ПроводкаНУ = Движения.Налоговый.Добавить();
						ПроводкаНУ.Организация = ВыборкаПоОрганизации.Организация;
						ПроводкаНУ.Период = НачДата;
						ПроводкаНУ.СчетДт = ВыборкаПоОрганизации.Счет.СчетНУ;
						
						ПроцедурыБухгалтерскогоУчета.УстановитьСубконто(ПроводкаНУ.СчетДт, ПроводкаНУ.СубконтоДт, 1, ВыборкаОбщая.Номенклатура);
											
						ПроводкаНУ.СчетКт = ПланыСчетов.Типовой.КраткосрочнаяДебиторскаяЗадолженностьПредставительств.СчетНУ;
						ПроцедурыБухгалтерскогоУчета.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, 1, КонтрагентОрганизации);
						ПроцедурыБухгалтерскогоУчета.УстановитьСубконто(ПроводкаНУ.СчетКт, ПроводкаНУ.СубконтоКт, 2, КонтрагентОрганизации.ОсновнойДоговорКонтрагента);
						
						ПроводкаНУ.Сумма = СуммаКорректировки;

						//ПроцедурыБухгалтерскогоУчета.УстановитьПодразделенияПроводки(Проводка, СтруктурноеПодразделение, СтруктурноеПодразделение);
						
						//-=-=
						СуммаКорректировкиОбщая = СуммаКорректировкиОбщая + Проводка.Сумма;
						//-=-=
				КонецЕсли;
			КонецЦикла;
			//-=-=
			Если Проводка <> Неопределено Тогда
				Проводка.Сумма = Проводка.Сумма - СуммаКорректировкиОбщая;
				ПроводкаНУ.Сумма = ПроводкаНУ.Сумма - СуммаКорректировкиОбщая;
				СуммаКорректировкиОбщая = 0;
			КонецЕсли;
			//-=-=
		КонецЦикла;
		
КонецПроцедуры
